<?php

namespace Domains\Topic\Support;

class TopicDictionary
{
    public static function all(): array
    {
        return [

            'جنگ' => [
                'جنگ',
                'حمله',
                'موشک',
                'پهپاد',
                'درگیری',
                'نیروهای نظامی',
            ],

            'ایران' => [
                'ایران',
                'تهران',
                'سپاه',
                'رئیس جمهور',
                'وزارت خارجه',
            ],

            'آمریکا' => [
                'آمریکا',
                'واشنگتن',
                'ترامپ',
                'کاخ سفید',
                'پنتاگون',
            ],

            'حمله' => [
                'حمله',
                'بمباران',
                'موشکی',
                'حمله هوایی',
            ],

            'فوری' => [
                'فوری',
                'خبر فوری',
                'هشدار',
                'لحظه ای',
            ],
        ];
    }
}
